# ~/projects/RatesTheory
#+TITLE:Rates, Standardisation and Adjustment
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----
#+name:load.project
#+begin_src R :session *R* :tangle no :exports none :eval no
  ###########################################################################
  # newnode: load.project
  require(ProjectTemplate)
  load.project()
#+end_src
*** pysal-crd-run-code
#+name:pysal-crd-run
#+begin_src sh :session *shell* 
python pysal-crd.py
#+end_src

#+RESULTS: pysal-crd-run
: [ 0.2375      0.26666667]



In the function call above, the last argument indicates the number of area units. 

|array([ 0.2375    ,  0.26666667])|

The outcome in the second line shows that the age-standardized rates for two areas are about 0.24 and 0.27, respectively.

Each set of numbers should include n by h elements where n and h are the number of areal units and the number of age groups. In the above example there are two regions with 4 age groups. Age groups are identical across regions. The first four elements in b represent the populations of 4 age groups in the first region, and the last four elements the populations of the same age groups in the second region.

*** crude-R-code
The same thing is trivial in R.  But this time we'll take a data.frame of cases and populations from two areas rather than seperate vectors, which is a more common way for health data to be arranged. 

#+name:crude-R
#+begin_src R :session *R* :tangle no :eval yes
  # func
  require(plyr)
  # load
  df <- read.table(textConnection(
  "a  e   b
  a 30 100
  a 25 100
  a 25 110
  a 15  90
  b 33 100
  b 21  90
  b 30 110
  b 20  90"
  ), sep = "", header = T)
  # check
  str(df)
  # do
  ddply(df, 'a', summarise, counts = sum(e), pop = sum(b), rate = sum(e)/sum(b))
  
#+end_src

#+RESULTS: crude-R
| a |  95 | 400 |            0.2375 |
| b | 104 | 390 | 0.266666666666667 |

